---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternStairPathOffset
source: html/d8681325-62a9-5c01-bf0e-2c34f580281d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternStairPathOffset Property

"Inside Walk Line Offset": The offset from inside walk line to interior boundary

## Syntax (C#)
```csharp
public static ForgeTypeId StairsWinderpatternStairPathOffset { get; }
```